1c/src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаСобственности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыСобственности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c/src/HTTPServices/ИнтеграционныйСервис/Ext/Module.bsl
#Область ОписаниеПеременных

// HTTP-сервис интеграции: отдаёт справочники «ФормыСобственности» и
// «Контрагенты» в JSON точно по формату ТЗ.
//
// Эндпоинты (после публикации на веб-сервере):
//   GET .../hs/integration/ownership-forms
//   GET .../hs/integration/counterparties
//   GET .../hs/integration/counterparties?changed_since=<RFC3339>
//   GET .../hs/integration/ownership-forms?changed_since=<RFC3339>
//   POST .../hs/integration/seed        - засеять демо-данные (идемпотентно)
//   POST .../hs/integration/touch?id=<guid>&name=<...>  - изменить контрагента
//   POST .../hs/integration/delete?id=<guid>            - пометить на удаление

#КонецОбласти

#Область ПрограммныйИнтерфейс

// GET /ownership-forms
Функция ФормыСобственностиGET(Запрос)
	ЧС = ПараметрChangedSince(Запрос);
	Если ЧС = Ложь Тогда
		Возврат ОтветJSON(Новый Структура("error", "invalid changed_since; expected RFC3339"), 400);
	КонецЕсли;
	Массив = Новый Массив;
	Лимит = ПараметрЦелое(Запрос, "limit", 500, 1, 5000);
	Смещение = ПараметрЦелое(Запрос, "offset", 0, 0, 1000000000);

	Запрос1 = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Код КАК Код,
	|	Т.Наименование КАК Наименование,
	|	Т.ДатаИзменения КАК ДатаИзменения,
	|	Т.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.ФормыСобственности КАК Т";
	Если ЗначениеЗаполнено(ЧС) Тогда
		ТекстЗапроса = ТекстЗапроса + " ГДЕ Т.ДатаИзменения > &ЧС";
		Запрос1.УстановитьПараметр("ЧС", ЧС);
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + " УПОРЯДОЧИТЬ ПО Т.Ссылка";
	Запрос1.Текст = ТекстЗапроса;

	Выборка = Запрос1.Выполнить().Выбрать();
	Пропущено = 0;
	Пока Выборка.Следующий() Цикл
		Если Пропущено < Смещение Тогда
			Пропущено = Пропущено + 1;
			Продолжить;
		КонецЕсли;
		Если Массив.Количество() >= Лимит Тогда
			Прервать;
		КонецЕсли;
		Стр = Новый Структура;
		Ид = ИдПоКодуФормы(Выборка.Код);
		Если НЕ ЗначениеЗаполнено(Ид) Тогда
			Ид = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		КонецЕсли;
		Стр.Вставить("id", Ид);
		Стр.Вставить("code", Выборка.Код);
		Стр.Вставить("name", Выборка.Наименование);
		Стр.Вставить("deleted", Выборка.ПометкаУдаления);
		Стр.Вставить("updated_at", ДатаВISO(Выборка.ДатаИзменения));
		Массив.Добавить(Стр);
	КонецЦикла;

	Возврат ОтветJSON(Массив);
КонецФункции

// GET /counterparties
Функция КонтрагентыGET(Запрос)
	ЧС = ПараметрChangedSince(Запрос);
	Если ЧС = Ложь Тогда
		Возврат ОтветJSON(Новый Структура("error", "invalid changed_since; expected RFC3339"), 400);
	КонецЕсли;
	Массив = Новый Массив;
	Лимит = ПараметрЦелое(Запрос, "limit", 500, 1, 5000);
	Смещение = ПараметрЦелое(Запрос, "offset", 0, 0, 1000000000);

	Запрос1 = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Код КАК Код,
	|	Т.Наименование КАК Наименование,
	|	Т.ИНН КАК ИНН,
	|	Т.КПП КАК КПП,
	|	Т.ФормаСобственности КАК ФормаСобственности,
	|	Т.ДатаИзменения КАК ДатаИзменения,
	|	Т.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.Контрагенты КАК Т";
	Если ЗначениеЗаполнено(ЧС) Тогда
		ТекстЗапроса = ТекстЗапроса + " ГДЕ Т.ДатаИзменения > &ЧС";
		Запрос1.УстановитьПараметр("ЧС", ЧС);
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + " УПОРЯДОЧИТЬ ПО Т.Ссылка";
	Запрос1.Текст = ТекстЗапроса;

	Выборка = Запрос1.Выполнить().Выбрать();
	Пропущено = 0;
	Пока Выборка.Следующий() Цикл
		Если Пропущено < Смещение Тогда
			Пропущено = Пропущено + 1;
			Продолжить;
		КонецЕсли;
		Если Массив.Количество() >= Лимит Тогда
			Прервать;
		КонецЕсли;
		Стр = Новый Структура;
		Стр.Вставить("id", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		Стр.Вставить("code", Выборка.Код);
		Стр.Вставить("name", Выборка.Наименование);
		Стр.Вставить("inn", ПустаяСтрокаВNull(Выборка.ИНН));
		Стр.Вставить("kpp", ПустаяСтрокаВNull(Выборка.КПП));
		Стр.Вставить("ownership_form_id", ИдФормыСобственности(Выборка.ФормаСобственности));
		Стр.Вставить("deleted", Выборка.ПометкаУдаления);
		Стр.Вставить("updated_at", ДатаВISO(Выборка.ДатаИзменения));
		Массив.Добавить(Стр);
	КонецЦикла;

	Возврат ОтветJSON(Массив);
КонецФункции

// POST /seed — восстановить эталонные демо-данные (4 формы, 5 контрагентов).
Функция SeedPOST(Запрос)
	// Формы собственности (по предопределённому имени в качестве id)
	СоздатьФорму("ooo", "000000001", "ООО");
	СоздатьФорму("ip",  "000000002", "ИП");
	СоздатьФорму("ao",  "000000003", "АО");
	СоздатьФорму("pao", "000000004", "ПАО");

	СоздатьКонтрагента("000001", "ООО Ромашка",    "7701234567",  "770101001", "ooo");
	СоздатьКонтрагента("000002", "ИП Иванов И.И.", "770212345678", "",          "ip");
	СоздатьКонтрагента("000003", "АО Север",       "7803001122",  "780301001", "ao");
	СоздатьКонтрагента("000004", "ПАО Энергия",    "7704556677",  "770401001", "pao");
	СоздатьКонтрагента("000005", "ООО Вектор",     "5001889900",  "500101001", "ooo");

	Результат = Новый Структура("status, ownership_forms, counterparties", "reset", 4, 5);
	Возврат ОтветJSON(Результат);
КонецФункции

// POST /touch?id=<guid>&name=<...> — изменить контрагента (обновит ДатаИзменения)
Функция TouchPOST(Запрос)
	Ид = Запрос.ПараметрыЗапроса.Получить("id");
	НовоеИмя = Запрос.ПараметрыЗапроса.Получить("name");
	Если ЗначениеЗаполнено(НовоеИмя) Тогда
		НовоеИмя = СтрЗаменить(НовоеИмя, "+", " ");
	КонецЕсли;
	Ссылка = НайтиКонтрагентаПоИд(Ид);
	Если Ссылка = Неопределено Тогда
		Возврат ОтветJSON(Новый Структура("error", "not found"), 404);
	КонецЕсли;
	Объект = Ссылка.ПолучитьОбъект();
	Если ЗначениеЗаполнено(НовоеИмя) Тогда
		Объект.Наименование = НовоеИмя;
	КонецЕсли;
	Объект.Записать();
	Возврат ОтветJSON(Новый Структура("status, id", "touched", Ид));
КонецФункции

// POST /delete?id=<guid> — пометить контрагента на удаление
Функция DeletePOST(Запрос)
	Ид = Запрос.ПараметрыЗапроса.Получить("id");
	Ссылка = НайтиКонтрагентаПоИд(Ид);
	Если Ссылка = Неопределено Тогда
		Возврат ОтветJSON(Новый Структура("error", "not found"), 404);
	КонецЕсли;
	Объект = Ссылка.ПолучитьОбъект();
	Объект.ПометкаУдаления = Истина;
	Объект.Записать();
	Возврат ОтветJSON(Новый Структура("status, id", "deleted", Ид));
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрChangedSince(Запрос)
	Значение = Запрос.ПараметрыЗапроса.Получить("changed_since");
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		// Параметр не передан => полная выборка (фильтр не добавляется).
		Возврат Неопределено;
	КонецЕсли;
	ДатаПараметра = ISOВДату(Значение);
	Если ДатаПараметра = Неопределено Тогда
		// Отличаем ошибочный параметр от его отсутствия: caller вернёт HTTP 400.
		Возврат Ложь;
	КонецЕсли;
	Возврат ДатаПараметра;
КонецФункции

Функция ПараметрЦелое(Запрос, Имя, ПоУмолчанию, Минимум, Максимум)
	Значение = Запрос.ПараметрыЗапроса.Получить(Имя);
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат ПоУмолчанию;
	КонецЕсли;
	Попытка
		Результат = Цел(Число(Значение));
	Исключение
		Возврат ПоУмолчанию;
	КонецПопытки;
	Если Результат < Минимум Тогда
		Возврат Минимум;
	КонецЕсли;
	Если Результат > Максимум Тогда
		Возврат Максимум;
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Соответствие внешнего id формы (ooo/ip/ao/pao) и кода справочника.
Функция КодПоИдФормы(Ид)
	Соотв = Новый Соответствие;
	Соотв.Вставить("ooo", "000000001");
	Соотв.Вставить("ip",  "000000002");
	Соотв.Вставить("ao",  "000000003");
	Соотв.Вставить("pao", "000000004");
	Возврат Соотв.Получить(Ид);
КонецФункции

Функция ИдПоКодуФормы(Код)
	Соотв = Новый Соответствие;
	Соотв.Вставить("000000001", "ooo");
	Соотв.Вставить("000000002", "ip");
	Соотв.Вставить("000000003", "ao");
	Соотв.Вставить("000000004", "pao");
	Ид = Соотв.Получить(СокрЛП(Код));
	Возврат Ид;
КонецФункции

Функция ИдФормыСобственности(Ссылка)
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Ид = ИдПоКодуФормы(Ссылка.Код);
	Если ЗначениеЗаполнено(Ид) Тогда
		Возврат Ид;
	КонецЕсли;
	Возврат Строка(Ссылка.УникальныйИдентификатор());
КонецФункции

Функция ФормаПоИд(Ид)
	Код = КодПоИдФормы(Ид);
	Если Код = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Справочники.ФормыСобственности.НайтиПоКоду(Код);
КонецФункции

Функция НайтиКонтрагентаПоИд(Ид)
	Если НЕ ЗначениеЗаполнено(Ид) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		Идентификатор = Новый УникальныйИдентификатор(Ид);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	Ссылка = Справочники.Контрагенты.ПолучитьСсылку(Идентификатор);
	Если Ссылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	// проверим существование
	Если НЕ ЗначениеЗаполнено(Ссылка.Код) И НЕ ЗначениеЗаполнено(Ссылка.Наименование) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Ссылка;
КонецФункции

Процедура СоздатьФорму(ПредопрИмя, Код, Наименование)
	Ссылка = Справочники.ФормыСобственности.НайтиПоКоду(Код);
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = Справочники.ФормыСобственности.СоздатьЭлемент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	Объект.Код = Код;
	Объект.Наименование = Наименование;
	Объект.ПометкаУдаления = Ложь;
	Объект.Записать();
КонецПроцедуры

Процедура СоздатьКонтрагента(Код, Наименование, ИНН, КПП, ФормаИд)
	Ссылка = Справочники.Контрагенты.НайтиПоКоду(Код);
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = Справочники.Контрагенты.СоздатьЭлемент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	Объект.Код = Код;
	Объект.Наименование = Наименование;
	Объект.ИНН = ИНН;
	Объект.КПП = КПП;
	Объект.ПометкаУдаления = Ложь;
	ФормаСсылка = ФормаПоИд(ФормаИд);
	Если ФормаСсылка <> Неопределено И НЕ ФормаСсылка.Пустая() Тогда
		Объект.ФормаСобственности = ФормаСсылка;
	КонецЕсли;
	Объект.Записать();
КонецПроцедуры

Функция ДатаВISO(Дата)
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Формат(Дата, "ДФ=yyyy-MM-ddTHH:mm:ss") + "Z";
КонецФункции

// Пустую строку приводим к Неопределено (=> null в JSON) для единообразия
// с mock-источником и корректного маппинга «если применимо» из ТЗ.
Функция ПустаяСтрокаВNull(Значение)
	Если ЗначениеЗаполнено(Значение) Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// Разбор RFC3339 (напр. 2026-07-14T04:01:24.438695+00:00) в дату 1С.
// Извлекаем первые 14 цифр = ГГГГММДДЧЧММСС, игнорируя разделители,
// микросекунды и смещение. Значение приходит в UTC (см. ДатаИзменения).
Функция ISOВДату(Стр)
	Попытка
		ТолькоЦифры = "";
		Для Позиция = 1 По СтрДлина(Стр) Цикл
			Симв = Сред(Стр, Позиция, 1);
			Если Симв >= "0" И Симв <= "9" Тогда
				ТолькоЦифры = ТолькоЦифры + Симв;
			КонецЕсли;
			Если СтрДлина(ТолькоЦифры) >= 14 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если СтрДлина(ТолькоЦифры) < 14 Тогда
			Возврат Неопределено;
		КонецЕсли;
		Возврат Дата(ТолькоЦифры);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция ОтветJSON(Значение, КодСостояния = 200)
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	ЗаписатьJSON(ЗаписьJSON, Значение);
	ТелоСтрока = ЗаписьJSON.Закрыть();
	Ответ.УстановитьТелоИзСтроки(ТелоСтрока, КодировкаТекста.UTF8);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Возврат Ответ;
КонецФункции

#КонецОбласти
